soap-sapi/src/main/resources/examples/ArrivalSoapRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <typ:AccessToken xmlns:typ="http://thalesgroup.com/RTTI/2013-11-28/Token/types">
      <typ:TokenValue>86cdc061-3f79-46b1-aee9-b1cccfd4ef5f</typ:TokenValue>
    </typ:AccessToken>
  </soap:Header>
  <soap:Body>
    <ldb:GetArrBoardWithDetailsRequest xmlns:ldb="http://thalesgroup.com/RTTI/2017-10-01/ldb/">
      <ldb:numRows>40</ldb:numRows>
      <ldb:crs>BSK</ldb:crs>
      <ldb:filterCrs>WAT</ldb:filterCrs>
      <ldb:filterType>to</ldb:filterType>
      <ldb:timeOffset>0</ldb:timeOffset>
      <ldb:timeWindow>120</ldb:timeWindow>
    </ldb:GetArrBoardWithDetailsRequest>
  </soap:Body>
</soap:Envelope>